#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Для Каждого СтрокаТоваров Из Товары Цикл
		Если СтрокаТоваров.ЯчейкаОтправитель = СтрокаТоваров.ЯчейкаПолучатель
			И ЗначениеЗаполнено(СтрокаТоваров.ЯчейкаПолучатель) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Строка %1: ячейки ""откуда"" и ""куда"" совпадают'"),
				СтрокаТоваров.НомерСтроки);
			Сообщение.Поле = СтрШаблон("Товары[%1].ЯчейкаПолучатель", СтрокаТоваров.НомерСтроки - 1);
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		Если СтрокаТоваров.Количество <= 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон(НСтр("ru = 'Строка %1: количество должно быть больше нуля'"), СтрокаТоваров.НомерСтроки);
			Сообщение.Поле = СтрШаблон("Товары[%1].Количество", СтрокаТоваров.НомерСтроки - 1);
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ТоварыВЯчейках.Записывать = Истина;

	Для Каждого СтрокаТоваров Из Товары Цикл

		Движение = Движения.ТоварыВЯчейках.ДобавитьРасход();
		Движение.Период = Дата;
		Движение.Ячейка = СтрокаТоваров.ЯчейкаОтправитель;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Количество = СтрокаТоваров.Количество;

		Движение = Движения.ТоварыВЯчейках.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Ячейка = СтрокаТоваров.ЯчейкаПолучатель;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Количество = СтрокаТоваров.Количество;

	КонецЦикла;

	Движения.ТоварыВЯчейках.БлокироватьДляИзменения = Истина;
	Движения.Записать();

	РегистрыНакопления.ТоварыВЯчейках.ПроверитьОстатки(Движения.ТоварыВЯчейках, Отказ);

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
