#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)

	ЗаполнитьПоЗаказуНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)

	Если Не ЗначениеЗаполнено(Объект.Заказ) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите заказ.'"));
		Возврат;
	КонецЕсли;

	ЗаполнитьПоЗаказуНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоЗаказуНаСервере()

	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьПоЗаказу();
	ЗначениеВРеквизитФормы(Документ, "Объект");

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти
