#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ТаблицаТоваров = Товары.Выгрузить(, "Номенклатура, Количество");
	ТаблицаТоваров.Свернуть("Номенклатура", "Количество");

	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		Движение = Движения.ОстаткиТоваров.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Номенклатура = СтрокаТоваров.Номенклатура;
		Движение.Количество = СтрокаТоваров.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
