#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьИзЗоныПриемки(Команда)

	Если Объект.Товары.Количество() = 0 Тогда
		ЗаполнитьИзЗоныПриемкиНаСервере();
		Возврат;
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("ЗаполнитьИзЗоныПриемкиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Табличная часть будет очищена и заполнена заново. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьИзЗоныПриемкиЗавершение(Ответ, ДополнительныеПараметры) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьИзЗоныПриемкиНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзЗоныПриемкиНаСервере()

	Размещение = Документы.РазмещениеТоваров.ТоварыДляРазмещенияИзЗоныПриемки();
	Объект.Товары.Загрузить(Размещение.Товары);

	Для Каждого ТекстОшибки Из Размещение.Ошибки Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
	КонецЦикла;

	Если Размещение.Товары.Количество() = 0 И Размещение.Ошибки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru = 'В зоне приемки нет товара'");
		Сообщение.Сообщить();
	КонецЕсли;

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти
